c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/InformationRegisters/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Membership</name>
  <dimensions>
    <name>Membership</name>
    <comment>Do not use name &quot;Group&quot;</comment>
    <type>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Users/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var IsNew;
var CurrentName;
var OldTenants;
var Removing;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( IsFolder ) then
		return;
	endif; 
	if ( not checkEmail () ) then
		Cancel = true;
	endif; 
	if ( not checkUserClass () ) then
		Cancel = true;
	endif; 
	checkCompanyAccess ( CheckedAttributes );
	checkOrganizationAccess ( CheckedAttributes );
	checkWarehouseAccess ( CheckedAttributes );
	
EndProcedure

Function checkEmail ()
	
	result = Mailboxes.TestAddress ( Email );
	if ( not result ) then
		Output.InvalidEmail ( , "Email" );
	endif; 
	return result;
	
EndFunction 

Function checkUserClass ()
	
	if ( UserClass = Enums.Users.Customer
		and OrganizationAccess = Enums.Access.Undefined ) then
		Output.OrganizationAccessMustBeInstalled ( , "OrganizationAccess" );
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure checkCompanyAccess ( CheckedAttributes )
	
	if ( CompanyAccess = Enums.Access.Allow
		or CompanyAccess = Enums.Access.Forbid ) then
		CheckedAttributes.Add ( "Companies" );
	endif; 
	
EndProcedure 

Procedure checkOrganizationAccess ( CheckedAttributes )
	
	if ( OrganizationAccess = Enums.Access.Allow
		or OrganizationAccess = Enums.Access.Forbid ) then
		CheckedAttributes.Add ( "Organizations" );
	elsif ( OrganizationAccess = Enums.Access.States ) then
		CheckedAttributes.Add ( "OrganizationsStates" );
	endif; 
	
EndProcedure 

Procedure checkWarehouseAccess ( CheckedAttributes )
	
	if ( WarehouseAccess = Enums.Access.Allow
		or WarehouseAccess = Enums.Access.Forbid ) then
		CheckedAttributes.Add ( "Warehouses" );
	elsif ( WarehouseAccess = Enums.Access.States ) then
		CheckedAttributes.Add ( "WarehousesStates" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel )

	if ( Cloud.SaaS ()
		and Connections.IsDemo () ) then
		Output.DemoMode ();
		Cancel = true;
		return;
	endif; 
	if ( DataExchange.Load
		or IsFolder ) then
		return;
	endif;
	IsNew = IsNew ();
	getCurrentName ();
	if ( not IsNew
		and DF.Pick ( Ref, "DeletionMark" ) <> DeletionMark ) then
		SetPrivilegedMode ( true );
		mark ( Catalogs.Mailboxes );
		mark ( Catalogs.UserSettings );
		markSession ( DeletionMark );
		disableRLS ();
		return;
	endif;
	
EndProcedure

Procedure getCurrentName ()
	
	if ( IsNew ) then
		CurrentName = Description;
	else
		CurrentName = DF.Pick ( Ref, "Description" );
	endif; 
	
EndProcedure 

Procedure mark ( Class )
	
	selection = Class.Select ( , Ref );
	while ( selection.Next () ) do
		if ( selection.DeletionMark <> DeletionMark ) then
			selection.GetObject ().SetDeletionMark ( DeletionMark );
		endif;
	enddo;

EndProcedure

Procedure markSession ( Mark )

	for each session in userSessions ( Mark ) do
		session.GetObject ().SetDeletionMark ( Mark );
	enddo;	
	
EndProcedure

Function userSessions ( Mark )

	s = "
	|select Sessions.Ref as Ref
	|from Catalog.Sessions as Sessions
	|where Sessions.User = &Ref
	|and Sessions.DeletionMark <> &Mark";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Mark", Mark );
	return q.Execute ().Unload ().UnloadColumn ( "Ref" );

EndFunction

Procedure disableRLS ()
	
	Removing = true;
	DataExchange.Load = true;

EndProcedure

Procedure OnWrite ( Cancel )
	
	skip = IsFolder or ( DataExchange.Load and not Removing );
	if ( skip ) then
		return;
	endif;
	SetPrivilegedMode ( true );
	if ( DeletionMark ) then
		LoginsSrv.Remove ( CurrentName );
	else
		makeAccess ();
		makeProfile ();
		if ( IsNew ) then
			setInterface ();
		endif;
	endif;
	if ( LoginsSrv.LastAdministrator () ) then
		Cancel = true;
		return;
	endif; 
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure makeAccess ()
	
	groups = undefined;
	if ( not AdditionalProperties.Property ( Enum.AdditionalPropertiesMembership (), groups ) ) then
		return;
	endif; 
	recordset = InformationRegisters.Membership.CreateRecordSet ();
	recordset.Filter.User.Set ( Ref );
	for each membership in groups do
		movement = recordset.Add ();
		movement.Membership = membership;
		movement.User = Ref;
	enddo; 
	recordset.Write ();
	
EndProcedure 

Procedure makeProfile ()
	
	user = getIBUser ();
	setProfile ( user );
	LoginsSrv.SetRights ( user );
	user.Write ();
	
EndProcedure 

Function getIBUser ()
	
	user = InfoBaseUsers.FindByName ( CurrentName );
	if ( user = undefined ) then
		user = InfoBaseUsers.CreateUser ();
	endif;
	return user;
	
EndFunction

Procedure setProfile ( User )
	
	User.Name = Description;
	User.FullName = FullName;
	User.ShowInList = Show;
	User.UnsafeOperationProtection.UnsafeOperationWarnings = Protection;
	if ( OSAuth ) then
		User.OSAuthentication = true; 
		User.OSUser = OSUser;
	else 
		User.OSAuthentication = false; 
		User.OSUser = undefined;
	endif;
	if ( LoginsSrv.Separated () ) then
		User.DataSeparation.Insert ( "Tenant", DF.Pick ( SessionParameters.Tenant, "Code" ) );
	endif;
	User.Language = Metadata.Languages.Find ( Language );
	password = undefined;
	if ( AdditionalProperties.Property ( Enum.AdditionalPropertiesPassword (), password ) ) then
		User.Password = password;
		LoginsSrv.SavePassword ( Ref, password );
	endif; 
	
EndProcedure 

Procedure setInterface ()
	
	settings = new ClientSettings ();
	settings.ShowNavigationAndActionsPanels = false;
	settings.ApplicationFormsOpenningMode = ApplicationFormsOpenningMode.Tabs;
	SystemSettingsStorage.Save ( "Common/ClientSettings", "", settings, , Description );
	
EndProcedure 

// *****************************************
// *********** Variables Initialization

Removing = false;

#endif
